(globalThis.TURBOPACK = globalThis.TURBOPACK || []).push(["chunks/ssr/src_utils_stateData_f63c70.js", {

"[project]/src/utils/stateData.js (ecmascript, ssr)": (({ r: __turbopack_require__, x: __turbopack_external_require__, f: __turbopack_require_context__, i: __turbopack_import__, s: __turbopack_esm__, v: __turbopack_export_value__, n: __turbopack_export_namespace__, c: __turbopack_cache__, l: __turbopack_load__, j: __turbopack_cjs__, k: __turbopack_refresh__, g: global, __dirname }) => (() => {

__turbopack_esm__({
    "default": ()=>__TURBOPACK__default__export__
});
const stateData = ()=>{
    const stateOptions = [
        {
            label: "آذربایجان شرقی",
            value: [
                "اسكو",
                "اهر",
                "ایلخچی",
                "باسمنج",
                "بستان آباد",
                "بناب",
                "تبريز",
                "تسوج",
                "جلفا",
                "خسروشهر",
                "سراب",
                "سهند",
                "شبستر",
                "صوفیان",
                "مراغه",
                "مرند",
                "ملكان",
                "ممقان",
                "ميانه",
                "هاديشهر",
                "هريس",
                "هشترود",
                "ورزقان"
            ]
        },
        {
            label: "آذربایجان غربی",
            value: [
                "اروميه",
                "اشنويه",
                "بوكان",
                "تكاب",
                "خوي",
                "سر دشت",
                "سلماس",
                "شاهين دژ",
                "ماكو",
                "مهاباد",
                "مياندوآب",
                "نقده",
                "پلدشت",
                "پيرانشهر",
                "چالدران"
            ]
        },
        {
            label: "اردبیل",
            value: [
                "اردبيل",
                "خلخال",
                "مشگين شهر",
                "نمين",
                "نير",
                "پارس آباد",
                "گرمي"
            ]
        },
        {
            label: "اصفهان",
            value: [
                "آران و بيدگل",
                "اردستان",
                "اصفهان",
                "باغ بهادران",
                "تودشک",
                "تيران",
                "حاجي آباد",
                "خميني شهر",
                "خوانسار",
                "درچه",
                "دهاقان",
                "زرين شهر",
                "سميرم",
                "شهرضا",
                "عسگران",
                "علويجه",
                "فلاورجان",
                "كاشان",
                "مباركه",
                "نجف آباد",
                "نطنز",
                "ورزنه",
                "کوهپایه",
                "گلپايگان"
            ]
        },
        {
            label: "ایلام",
            value: [
                "آبدانان",
                "ايلام",
                "ايوان",
                "دره شهر",
                "دهلران",
                "سرابله",
                "مهران"
            ]
        },
        {
            label: "بوشهر",
            value: [
                "اهرم",
                "برازجان",
                "بوشهر",
                "جم",
                "خورموج",
                "دير",
                "عسلویه",
                "كنگان",
                "کاکی",
                "گناوه"
            ]
        },
        {
            label: "تهران",
            value: [
                "اسلامشهر",
                "باقرشهر",
                "بومهن",
                "تجريش",
                "تهران",
                "دماوند",
                "رباط كريم",
                "رودهن",
                "ري",
                "شريف آباد",
                "شهريار",
                "فشم",
                "فيروزكوه",
                "قدس",
                "قرچك",
                "كهريزك",
                "لواسان",
                "ملارد",
                "ورامين",
                "پاكدشت",
                "چهاردانگه"
            ]
        },
        {
            label: "چهارمحال و بختیاری",
            value: [
                "اردل",
                "بروجن",
                "شهركرد",
                "فارسان",
                "لردگان",
                "چلگرد"
            ]
        },
        {
            label: "خراسان رضوی",
            value: [
                "تايباد",
                "تربت جام",
                "تربت حيدريه",
                "خواف",
                "درگز",
                "سبزوار",
                "سرخس",
                "طبس",
                "طرقبه",
                "فريمان",
                "قوچان",
                "كاشمر",
                "مشهد",
                "نيشابور",
                "چناران",
                "گناباد"
            ]
        },
        {
            label: "خوزستان",
            value: [
                "آبادان",
                "انديمشك",
                "اهواز",
                "ايذه",
                "ايرانشهر",
                "باغ ملك",
                "بندر امام خميني",
                "بندر ماهشهر",
                "بهبهان",
                "حمیدیه",
                "خرمشهر",
                "دزفول",
                "رامشیر",
                "رامهرمز",
                "سوسنگرد",
                "شادگان",
                "شادگان",
                "شوش",
                "شوشتر",
                "لالي",
                "مسجد سليمان",
                "ملاثانی",
                "هنديجان",
                "هويزه"
            ]
        },
        {
            label: "سیستان و بلوچستان",
            value: [
                "ايرانشهر",
                "خاش",
                "زابل",
                "زاهدان",
                "سراوان",
                "سرباز",
                "ميرجاوه",
                "چابهار"
            ]
        },
        {
            label: "فارس ",
            value: [
                "آباده",
                "اردكان",
                "ارسنجان",
                "استهبان",
                "اقليد",
                "بوانات",
                "جهرم",
                "حاجي آباد",
                "خرامه",
                "خنج",
                "داراب",
                "زرقان",
                "سروستان",
                "سوريان",
                "سپيدان",
                "شيراز",
                "صفاشهر",
                "فراشبند",
                "فسا",
                "فيروز آباد",
                "كازرون",
                "لار",
                "لامرد",
                "مرودشت",
                "مهر",
                "کوار"
            ]
        },
        {
            label: "کرج ",
            value: [
                "اشتهارد",
                "طالقان",
                "كرج",
                "ماهدشت",
                "نظرآباد",
                "هشتگرد"
            ]
        },
        {
            label: "کرمان ",
            value: [
                "انار",
                "بافت",
                "بردسير",
                "بم",
                "جيرفت",
                "راور",
                "رفسنجان",
                "زرند",
                "سيرجان",
                "كرمان",
                "كهنوج",
                "کوهبنان"
            ]
        },
        {
            label: "کرمانشاه ",
            value: [
                "اسلام آباد غرب",
                "جوانرود",
                "سنقر",
                "صحنه",
                "قصر شيرين",
                "كرمانشاه",
                "كنگاور",
                "هرسين",
                "پاوه"
            ]
        },
        {
            label: "گلستان ",
            value: [
                "آزاد شهر",
                "آق قلا",
                "راميان",
                "علي آباد كتول",
                "كردكوی",
                "كلاله",
                "گرگان",
                "گنبد كاووس"
            ]
        },
        {
            label: "گیلان ",
            value: [
                "آستارا",
                "املش",
                "تالش",
                "رشت",
                "رودبار",
                "شفت",
                "صومعه سرا",
                "فومن",
                "لاهیجان",
                "لنگرود",
                "ماسال",
                "ماسوله",
                "منجيل",
                "هشتپر"
            ]
        },
        {
            label: "لرستان ",
            value: [
                "ازنا",
                "الشتر",
                "اليگودرز",
                "بروجرد",
                "خرم آباد",
                "دزفول",
                "دورود",
                "كوهدشت",
                "ماهشهر",
                "نور آباد"
            ]
        },
        {
            label: "مازندران ",
            value: [
                "آمل",
                "بابل",
                "بابلسر",
                "بلده",
                "بهشهر",
                "تنكابن",
                "جويبار",
                "رامسر",
                "ساري",
                "قائم شهر",
                "محمود آباد",
                "نكا",
                "نور",
                "نوشهر",
                "چالوس"
            ]
        },
        {
            label: "هرمزگان ",
            value: [
                "بستك",
                "بندر جاسك",
                "بندر خمیر",
                "بندر لنگه",
                "بندرعباس",
                "حاجي آباد",
                "دهبارز",
                "قشم",
                "قشم",
                "كيش",
                "ميناب"
            ]
        },
        {
            label: "همدان ",
            value: [
                "اسدآباد",
                "بهار",
                "رزن",
                "ملاير",
                "نهاوند",
                "همدان"
            ]
        },
        {
            label: "یزد ",
            value: [
                "ابركوه",
                "اردكان",
                "اشكذر",
                "بافق",
                "تفت",
                "خضرآباد",
                "زارچ",
                "طبس",
                "مهريز",
                "ميبد",
                "هرات",
                "يزد"
            ]
        }
    ];
    return stateOptions;
};
const __TURBOPACK__default__export__ = stateData;

})()),
}]);

//# sourceMappingURL=src_utils_stateData_f63c70.js.map